[Main]
DisplayName=Maltese

[Uninstaller_frmIObitUninstall]
rdibFeedback.Caption=Feedback

[Uninstaller_fraBrowserCleaner]
lbl_NoItems.caption=M'ghandekx toolbars u plug-ins fil-browser tieghek
rdlvAllBrowse.Columns[0].Caption=Isem
rdlvAllBrowse.Columns[1].Caption=Ir-Rating tal-User
rdlvAllBrowse.Columns[2].Caption=Operazjoni
rdlvCustomBrowse.Columns[0].Caption=Isem
rdlvCustomBrowse.Columns[1].Caption=Operazjoni
mniRemove.Caption=Nehhi
mniRate.Caption=Rate
mniIgone.Caption=Injora
mniRefush.Caption=Refresh
mniOpenFloder.Caption=Iftah il-location tal-file
mniOpeninRegedit.Caption=Iftah bir-Regedit
mniSelectedAll.Caption=Aghzel kollox
mniInvertSelection.Caption=Invertja is-selezzjoni
mniSearchOnline.Caption=Fittex online

[Uninstaller_frmRestBrowserDefault]
lbl_Caption.Caption=Irrisettja l-Browser
lblConfire.Caption=Trid tirrestorja ghad default settings?
lblHomepageTitle.Caption=Il-Homepage kurrenti:
lblSearchTitle.Caption=Is-Search Engine tad-Default:
btnImg_OK.Caption=OK
btnImg_Cancel.Caption=Ikkancella

[Uninstaller_frm_FeedBack]
lbl_Title.caption=Il-FeedBack
lbl_DescTitle.caption=Description:
lbl_EmailTitle.caption=E-mail:
lbl_ScreenShot.caption=ScreenShot
lbl_TypeTitle.caption=Request type:
btnImg_FeedBackSend.caption=Ibghat
btnImg_FeedBackCancel.caption=Ikkancella
lbl_ContactMsg.caption=jew ikkuntatjana direttament

[Uninstaller_From_PluginNotice]
lbl_Title.caption=IObit Uninstaller
btnImg_Remove.caption=Nehhi
lbl_NoTkanks.caption=Tergax turiha

[Uninstaller_frmSetting]
lbl_Caption.caption=Is-settings
lbl_UserInterfaceTitle.caption=User Interface
lbl_SkinTitle.caption=Skin:
lbl_LanguageTitle.caption=Il-Lingwa kurrenti:
lbl_FontSize.caption=Font size:
lbl_Classic.caption=Classic
lbl_White.caption=Abjad
lbl_UpdateTitle.caption=Update Method
lbl_UpdateRemind.caption=Fakkarni meta jkun hemm xi abdejts
lbl_UpdateChooseDes.caption=Update method ta'dan il-prodott:
lbl_UpdateAuto.caption=Abdejt awtomatiku
lbl_GeneralCaption.caption=Generali
lbl_AutoDelete.caption=Nehhi awtomatikament il-files li jivdal
lbl_AutoDeleteAfterOtherUninstall.caption=Hassar awtomatikament il-fdalijiet ta'uninstallers li gew anintallati
lbl_RemoveToRecycleBin.caption=Iddilitja il-files fir-Recycle Bin
lbl_ShowExplorerButton.caption=Zid l-x-Shred File button fl-explorer
lbl_Notification.caption=Notification
lbl_AutoShowTipForm.caption=Avzani meta uninstallers ohrajn jaghmlu uninstall ta' xi programm
lbl_BrowserPlugTip.caption=Avzani meta plug-ins hziena jigu nstallati
btnImg_OK.caption=OK
btnImg_Cancel.caption=Ikkancella

[Uninstaller_Frame_Win8App]
ListView_AppList.Columns[0].caption=Isem
ListView_AppList.Columns[1].caption=Size
ListView_AppList.Columns[2].caption=Id-data ta' l-installazzjoni
ListView_AppList.Columns[3].caption=Operazjoni
lbl_Notice.caption=Biex jidhru l-Windows Apps, kun zgur li l-account tieghek ghandu l-administrative rights.
mniUninstall.caption=Aninstalla
mniRefush.caption=Refresh
mniView.caption=Uri
mniDetails.caption=Dettalji
mniIcons.caption=Ikoni
mniOpenFile.caption=Iftah il-file location
mniOpenReg.caption=Iftah fir-Regedit
mniOpenWinstore.caption=Iftah fil-Winstore
mniSearchOnline.caption=Fittex online

[Uninstaller_Frame_Update]
ListView_Update.Columns[0].caption=Isem
ListView_Update.Columns[1].caption=Install date
ListView_Update.Columns[2].caption=Operazjoni
lbl_NoItems.caption=Ma'stabux abdejts.
mniUninstall.caption=Aninstalla
mniRefush.caption=Refresh
mniViewby.caption=Uri
mniDetails.caption=Dettalji
mniIcons.caption=Ikoni

[Uninstaller_frmForcedUninstall]
lbl_Caption.caption=Force Uninstall
lbl_FUInfo.caption=Force Uninstall jghinek t-aninstalla programmi li ma jkunux jistghu jigu aninstallati bhas soltu u jnehhilek il-fdalijiet tieghu. Jista jnehhilek shortcut u target file facilment.
btnImg_Open.caption=Browse...
lbl_DropInfo.caption=Tista tibbrawzja u 'drag and drop' il-files jew folder hawn biex tiddilitja jew t'aninstalla il-programm relatat mieghu.
btnImg_Uninstall.caption=Aninstalla
btnImg_Cancel.caption=Ikkancella
PopMenu_Uninstall.caption=Aninstalla
PopMenu_OpenFolder.caption=Iftah File Location
PopMenu_ViewEntry.caption=Iftah bir-Regedit
PopMenu_SearchOnline.caption=fittex online
ListView_FindReslut.Columns[0].caption=Uri l-isem
ListView_FindReslut.Columns[1].caption=Size
ListView_FindReslut.Columns[2].caption=Install Date

[Uninstaller_frmUninstallForm]
mniMenu_Regedit.caption=Iftah bir-Regedit
mniMenu_Path.caption=Iftah File Location
btnImg_AllMainCancel.caption=Ikkancella
btnImg_Advanced.caption=Advanced
btnImg_Uninstall.caption=Uninstall
lbl_AutoDelete.caption=Inehhilek il-fdalijiet tal-files
lbl_IsCreateRestore.caption=Ohloq restore point qabel t'aninstalla
lbl_IsUninstallHint.caption=Inti trid li t'anisstalla dan il-program?
btnImg_Delete.caption=Iddilitja
btnImg_ReslutCancel.caption=Ikkancella
lbl_SeletedAll.caption=Aghzel kollox
lbl_ShredFile.caption=Xreddja l-files
lbl_AllRestart.caption=Irributja il-komputer biex t'aninstalla kompletament il-program. Irributja issa?
lbl_NoPowerScan.caption=L-Aninstallar Komplut.
lbl_SomeNeedStart.caption=Irributja il-komputer biex t'aninstalla kompletament il-program. Irributja issa?
btnImg_RecommendClose.caption=Aghalaq
btnImg_Restart.caption=Iva
lbl_MoneyBackInfo.caption=Inti se tgawdi ikar il-PC billi tnehhi kompletament plugins u programmi li ma tridx. 60-gurnata flus lura iggarantiti. Bla ebda mistoqsija.
lbl_MoneyBackTitle.caption=Garanzija li janinstallalek li trid u jnaddaflek il-PC
lbl_UninstallCompleted.caption=L-Aninstallar Komplut!
lbl_PluginTitle.caption=Biex ikollok surfing tajjeb, trid tirranga dawn li gejjin:
lbl_UpgradeDes.caption=Biex tirranghom, Abdejtja ghall IObit Uninstaller PRO Issa.
lbl_AutoUpdateDes.caption=Inaddaf il-fdalijiet ta prgrammi mil-qiegh
lbl_CleanDes.caption=Jiddidektja bundleware facilment
lbl_MoreDBDes.caption=Inehhiprogrammi xi ftit rashom iebsa biex tnehhiehom
lbl_ProTitle.caption=Imma bill PRO edition, Tista:
lbl_RemovePlugin.caption=Tnehhi plugins hziena biex tizgura web browsing hafif
lbl_SupportDes.caption=Izommlok il-programmi mportanti dejjem up to date

[Uninstaller_frm_CheckRelatedForm]
btnImg_OK.caption=Aninstalla
btnImg_Cancel.caption=Ikkancella

[uninstaller_frmSystemRestore]
lbl_Caption.Caption=System Restore
rdlblDesc.Caption=Irrestorja il-Komputer Kif kien qabel ma'bdejt tahdem. L-Ahhar restore ma jistax jigi iddilitjat ghas-sigurta'.
ListView_Restore.Columns[0].Caption=Data w Hin
ListView_Restore.Columns[1].Caption=Description
btn_CreateRestorePoint.Caption=Ohloq Restore Point
RdImageButton_Restore.Caption=Restore
RdImageButton_Delete.Caption=Iddilitja
lblNull.Caption=Ma'hloqtx restore point.

[Uninstaller_Form_CleanTool]
RdLabelCaption.caption=Naddaf li fadal
lbl_Frame_Detail.caption=Il-Cleanup Residual jghinek t-aninstalla programmi li ma jkunux jistghu jigu aninstallati bhas soltu u jnehhilek il-fdalijiet tieghu. Tista tnehhilek shortcut u target file facilment.
lbl_Shortcut_Title.caption=Shortcuts Invalidi
lbl_Shortcut_Detail.caption=Scanja u nehhi l-invalid shortcuts fl- start menu, id-desktop biex ittejjeb s-sistema &&  esperjenza tal-user.
lbl_WindowsPatch_Title.caption=Windows Patch Cache
lbl_WindowsPatch_Detail.caption=Inaddaf il-cache iggenerat waqt li qed jinstalla xi patches biex izidlek id-disk space u s-sistema tahdem tajjeb.
lbl_Download_Title.caption=Download Folder
lbl_Download_Detail.caption=Lis-scan files tad-default download folder tal-browsers u d-downlowd tools. Qabel tiddilitja, kun zgur li mhumiex ta' bzonn.
Menu_Clean_OpenFileLocation.caption=Iftah il-File Location
Menu_Clean_SelectAll.caption=Aghzel kollox
Menu_Clean_InvertSelection.caption=Invert Selection
ListView_Clean.Columns[0].Caption=File Path
RdLabelBack.Caption=Lura
ck_SelectALL.Caption=Aghzel kollox

[uninstaller_FormHistoryCombox]
RdImgBtnNoThanks.caption=Le,Grazzi
RdImgBtnUninstall.caption=Aninstalla
RdListView_History.Columns[0].Caption=Isem il-program
RdListView_History.Columns[1].Caption=State

[uninstaller_Form_UninstallLog]
RdImageButton_Closetwo.caption=Aghlaq

[Uninstaller_Form_FileShardder]
RdLabelCaption.caption=File Shredder
lbl_Listview_Title.caption=Aghzel il-file u l-folder li trid tixxredja:
lblLoading.caption=Qed jillowdja...
lbl_AddFile.caption=Zid file...
lbl_AddFolder.caption=Zid folder...
RdImageButton_Shredder.caption=Xredja
RdImageButton_Cancel.caption=Ikkancela
ListView_FileList.Columns[0].Caption=File Path
Menu_Shredder_Shredder.caption=Xredja
Menu_Shredder_AddFile.caption=Zid File
Menu_Shredder_AddFolder.caption=Zid Folder
Menu_Shredder_Romove.caption=Nehhi
Menu_Shredder_Clean.caption=Ikklerja
lbl_Shredder_Tip.caption=Qed jixreddja l-files issa. Tista tiehu ftit tal-hin, Stenna ftit...

[uninstall_Mitor_M]
ProStillLeavesone_M=%d Il-progrmm hallilek:
Lbl_metro_Atten.caption=Attenzjoni
lbl_show.caption="%s" baqa xi ftit fdalijiet, li jaffetjawlek il-performance tal-PC.
Donotagain_M=Tergax turini din
Hide_M=Ahbi
showDetails_M=Uri d-dettalji
Cleanmanually_M=naddaf manwalment
Close_M=Aghlaq
AutoClean_M=Tindif awtomatiku
Cleaning_M=qed inaddaf
Cleannow_M=Naddaf Issa
StillLeavas_M="%s" ghad baqa:
RegistryEntries_M=Dhul fir-Registry
MBFiles_M=MB files
LeftBy_M=left by "%s" gew iddilitjati
Cleanfuture_M=Naddaf awtomatikament fil-futur
Registry_M=Registry
File_M=File
Files_M=files
Items_M=items
Item_M=item
rdlblCleanupCompleted.caption=It-tindif huwa lest
rdlblIncomplete.caption=L-Aninstallar mhux komplut
Setting_M=Setting
Uselessfiles_M=File bla uzu
Uselessregistryentries_M=Dhul fir-Registry bla uzu
UselessregistryentriesOne_M=registry entry bla'uzu
Removingnow_M=Qed inehhihom Issa...
rdlblRemoving.caption=Qed inehhihom Issa...
TrayHintstill=Still %d Il-fdalijiet jistghu jigu rrangati.
CCtrayHint_M=Still %d+ Il-fdalijiet jistghu jigu rrangati.
LeftoversRemoved_M=Il-fdalijiet imnehhija:
ProStillLeaves_M=%d Programmi li baqa:

[UninstallHistory_M]
rdlbl_NoTkanks.caption=Le, grazzi
RdImageButtonImageButton_Uninstall.caption=Aninstalla

[Uninstaller_frmAbout]
lbl_Warnning_Title.caption=Attenzjoni
Lbl_Warnning_Detail.caption=Dan il-program huwa protett bill copyright law u trattati internazzjonali.
lbl_copyright.caption=Copyright© 2005-2018 IObit. All rights reserved.
lbl_Thanks_Title.caption=Special thanks to the following people for their great contributions:
rdhtmlEula.caption=<a>EULA</a> | <a>Privacy Policy</a>

[Uninstaller_Frame_Software]
ListView_SoftwareList.Columns[1].Caption=Il-Qies
ListView_SoftwareList.Columns[2].Caption=Id-data ta'l-installazzjoni
ListView_SoftwareList.Columns[3].Caption=Operazzjoni
Menu_Program_Uninstall.caption=Aninstalla
Menu_Program_Repair.caption=Irranga
Menu_Program_Refresh.caption=Refresh
Menu_Program_ViewBy.caption=View by
Menu_Program_icons.caption=Ikoni
Menu_Program_Details.caption=Dettalji
Menu_Program_OpenFileLocation.caption=Open file location
Menu_Program_OpeninRegedit.caption=Iftah bir-Regedit
Menu_Program_SearchOnline.caption=Fittex online

[uninstaller_Form_Activate]
Label_Get.caption=Get License
Label_Retrv.caption=Nizzel il-Code
Label_Eg.caption=E.g.: AAAAA-BBBBB-CCCCC-DDDDD
lblTitleOne.caption=Tnehhija ta' programm iebes
lblContentOne.caption=Inaddaflek programmi iebsin b'teknologija avvanzata u database kbira
lblTitleTwo.caption=Inehhilek il-Bundleware kollhu
lblContentTwo.caption=Jiehu hsieb l-installazzjoni u jiddditdekja u j'aninstalla il-bundleware u l-bundled plug-ins facilment
lblTitleThree.caption=Browser hafif u sikur
lblContentThree.caption=inehhilek ads plug-ins/extensions biex ikollok esperjenza safe on line
lblTitleFour.caption=Updater l-aktar gdid
lblContentFour.caption=izommlok l-aktar programmi importanti up to date
RdImgBtnRegNow.caption=Irregistra issa
RdLabelCaption.caption=Attiva il- Pro Edition ghall esperjenza mill-aqwa
Label_Please.caption=Dahhal il-license code u klikkja l-buttuna "Irregistra Issa" biex t-attiva  il-funzjonijiet tal-PRO edition.
Label_Code.caption=License code:
Label_More.caption=Aktar beneficcji, nwghedukhom:
RdImgBtn_Upgrade.caption=Abgrejdja ghal PRO
rdlblHelp.caption=ghajnuna

[uninstaller_Form_LicenseManager]
RdImgBtn_close.caption=Aghlaq
rdlblHelp.caption=ghajnuna
Label_Please.caption=Dahhal il-license code u klikkja l-buttuna "Irregistra Issa" biex t-attiva  il funzjonijiet tal-PRO edition.
Label_Code.caption=License code:
RdImgBtnRegister.caption=Irregistra Issa
Label_Retrv.caption=Iehu l- Code
Label_HaveLicense.caption=M'ghandekx licenzja?
Label_click.caption=Klikkja hawn ghal wahda.
RdImageButton_Back.caption=Lura
RdImageButton_Close.caption=Aghlaq
RdLabelCaption.caption=License Manager
Label_Status.caption=License status:
Label_Activated.caption=Attivat
Label_Lcode.caption=License code:
Label_Data.caption=Data meta jiskadi:
Label_Refresh.caption=Refresh
Label_Export.caption=Esporta l-license
rdlblAlread.caption:=diga ghandi license code

[uninstaller_Form_licensemessage]
rdlblHelp.caption=ghajnuna
RdImgBtn_Closetwo.caption=Aghlaq
Label_success.caption=Il-licenzja hija attivata b'success!

[uninstaller_ToolUninstallHistroy]
RdLabelDetail.caption=Hawn il-logs u l-istatus tal-uninstallazzjoni. Jekk fl-istatus baqa xi files, ikklikkja Scan biex isiblek u jnehhilek il-fdalijiet.
RdLabelCaption.caption=Uninstall History
ListView_History.Columns[1].Caption=Uninstall Date
ListView_History.Columns[2].Caption=Size
ListView_History.Columns[3].Caption=State
ListView_History.Columns[4].Caption=Operazjoni
Menu_ClearThis.Caption=Ikklirja din ir-record
Menu_ClearAll.Caption=Iklirja Kollox

[Monitor_FormMainInitWizard_M]
M_NoticeInfo_AB=1. Ikklikkja tax-xellugu kaxkar il-mouse biex taghzel l-area li trid ghal-screenshot
M_NoticeInfo_AC=2. Ikklikja tal-lemin jew ghafas 'Esc' biex tohrog
M_Rect=Rectangle
M_Oval=Ovali
M_Text=Text
M_Paintbrush=Paintbrush
M_Return=Restore operation Ctrl + Z
M_Copy=Copy to clipboard
M_Exit=Exit screenshot
M_Save=Issejvja
M_TipInfo=Lis- screenshot issejvjat fil-clipboard. Tista t'uza is-Ctrl + V to paste.
M_TipShow=Tergax turini dan il-messagg
M_TipSure=OK
M_NoticeInfo=①  Ikklikkja tax-xellugu kaxkar il-mouse biex tista tiehu screenshot
M_NoticeInfo_a=②  Ikklikkja tal-lemin jew Esc biex tohrog

[Uninstaller_Form_SendResult]
lbl_Sending.caption=Qed Jibghat...
lbl_SendFailed.caption=Is-Send falla. Ikklikkja OK biex taghmel feedback on line.
btnImg_SendFailed.caption=OK
lbl_SendSuccess.caption=Grazzi tal-feedback. Ahna ser nikkuntatjawk lura malarj.
btnImg_SendSuccess.caption=OK

[Uninstaller_Form_UptoPro]
Rdlb_UpdateManually.caption=Abdejtja manwalment
Rdlb_lbOpenBuyWeb.caption=Iddejjaqt t'abdejtja manwalment?
RdLb_OpenBuyWeb.caption=Attiva l-Automatic Update

[Uninstaller_M]
MainGiftbox_Hint=%D% mill-Offerta Specjali
MainUpdate_Hint=Hawn verzjoni gdida
Startup_Delete_M=Iddilitja
LicenseSeat_M=License Seat:
Powerful_File_Reboot_M=Il-file jigi 'ddlitjat mar-reboot:
Powerful_File_Del_M=File Iddilitjat:
Powerful_Reg_Sucess_M=Ir-Registry iddilitjat:
Powerful_Reg_Faild_M=Id-dilitjar tar-registry falla:
Powerful_Task_Sucess_M=It-Task Scheduler iddilitjat:
Powerful_Task_Faild_M=It-Task Scheduler falla li jiddilitja:
Powerful_Services_Sucess_M=Service iddilitjat:
Powerful_Services_Faild_M=Id-delete tas-service falla
CodeLiftTime_M=Dan huwa license code, validu ghall-IObit Uninstaller v6. Jekk joghgbok erga installa il v6 PRO.
ShredderDetail_1=Il-Files iddilitjati jistghu jigu recovered anke wara disk format.
ShredderDetail_2=Il-File shredder jghinek tnehhi files permanentament.
Program_Information=Informazjoni tal-program
Files_Deleted=Files iddilitjati
Registries_Deleted=Registries iddilitjati
Scheduled_Tasks_Deleted=Scheduled Tasks iddilitjati
Deleted_on_Reboot=iddilitjati wara Reboot
Service_Deleted=Service idilitjati
HtmlADPluginCaption=<a>%d</a> Ad Plug-ins interference
HtmlMaliciousPluginCaption=<a>%d</a> Malicious Plug-ins threat
MenuRight_Caption=Powerful Uninstall
UninstallLog_No_IsEmpty_M=Ma' baqax files iktar wara powerful scan
Input_Text_Search=Fittex
Hint_Settings=Options
Hint_WindowMin=Cekken
Hint_WindowMax=Kabbar
Hint_WindowRest=Irrestorja
Hint_WindowClose=Aghlaq
Hint_Tools=Tools
Nav_Colle_Program_All=Programmi
Nav_Colle_Browser=Toolbars & Plug-ins
Nav_Colle_Win=Windows Apps
Nav_Colle_AC=Action Center
Nav_Item_Program_All=All Programs
Nav_Item_Program_Recent=Installati ricenti
Nav_Item_Program_Infrequent=Ma tantx jintuzaw
Nav_Item_Program_Large=Programmi Kbar
Nav_Item_Win_Update=Windows Update
Nav_Item_Browser_All=It-Toolbars & Plug-ins Kollha
Button_Uninstall=aninstalla
Button_Remove=Nehhi
Button_OK=OK
Button_Cancel=Ikkancella
Button_Close=Aghlaq
Button_Yes=Iva
Button_No=Le
Button_Continue=Kompli
FileCorruptedMsg=Certu files gew korrotti. Jekk joghgbok erga installa l-IObit Uninstaller.
Program_Mult=Il-program diga' miftuh taht kont iehor. Ohrog barra minn dak il-kont ta dak il-user qabel terga tinstallah.
ToolPopForceUninstall=Force Uninstall
ToolPopCleanup=Cleanup Residual
ToolPopHistory=Uninstall History
ToolPopFileShredder=File Shredder
MoreSettingPopSetting=Settings...
MoreSettingPopRestore=Restore
MoreSettingPopExport=Export program list
MoreSettingPopUpdate=Check for updates
MoreSettingPopManual=User Manual
MoreSettingPopSupport=Technical support
MoreSettingPopOnline=IObit online
MoreSettingPopLike=Like
MoreSettingPopAbout=About
DefaultSelProg=Aninstalla programmi bla bzonn biex izzid lis-spazzju.
DefaultSelPlug=Nehhi plug-ins bla bzonn biex jipprotegilek il- browser.
DefaultSelWApp=Uninstalla l-Windows Apps bla bzonn biex ihaffiflek il-PC.
SelInfoProg=Program maghzul biex jigi aninstallat.Size Totali:
SelInfoProgM=Program maghzul biex jigi aninstallat.Size Totali:
SelInfoPlug=plug-in maghzul biex jitnehha.
SelInfoPlugM=plug-ins maghzula biex jitnehhew.
SelInfoUpdate=Windows Update maghzula biex jigu aninstallati.
SelInfoUpdateM=Windows Updates maghzula biex jigu aninstallati.
SelInfoWApp=app maghzul biex jigi aninstallat.
SelInfoWAppM=apps maghzula biex jigu aninstallati.
v_license_OtherCode_M=Il-Licenzja%s hija valida ghal %s. Jekk joghgbok ikklikkja OK biex tiddawnlowdja u tirregistra%s.
Cannotconnect_M=Ma tistax taqbad mas-server taghna. Iccekkja n-network/proxy settings u erga ipprova l-license wara.
license_OtherGivewalys_M=%s hija licenzja mghotija u valida biss ghal certu verzjoni. Idhol hawnhekk<a>hawn</a> biex tixtri licenzja ohra ghall IU v7 PRO.
SysRestore_CreateComplete=Qed jinholoq Restore Point b'success!
SysRestore_CreateFailed=Ir-Restore Point falla! Iccekkja li Ir-Restore hija attivata.
SysRestore_CreateRestore_Confirm=Inti zgur li trid tohloq restore point?
SysRestore_CreateRestore_Tip=Qed jinholoq Restore Point, stenna ftit...
SysRestore_CreateRestore_Failed=Il-holqien ta' Restore Point falliet! Iccekja jekk ir-restore mhux attivata.
SysRestore_SetRestore_Confirm=WARNING: Meta tirrestoja is- sistema ghal restore point ihassarlek it-tibdil kollu li tkun ghamilt wara dik restore point. Ga la darba tibda,is-System Restore ma tistax twaqfu. Inti gur li trid tkompli?
SysRestore_SetRestore_Reboot=A reboot huwa mehtieg biex isiru t-tibdiliet. Issejvja dawk il-files miftuha u ghalaq il-programmi kollha qabel ir-reboot. Tirributja il-PC issa?
SysRestore_SetRestore_Tip=Qed jirrestorja is-system files u is-settings, stenna ftit...
SysRestore_Delete_Confirm=Inti zgur li trid tiddilitjah?
Clean_Shortcuts_GroupsHeader_M=Invalid Shortcuts
Clean_WindowsPatch_GroupsHeader_M=Windows Patch Cache
Clean_Download_GroupsHeader_M=Download Folder
Shredder_Del_M=Inti zgur li trid tnehhi ghal dejjem l-items%d mizjuda? Din l-azzjoni hi zgur UNRECOVERABLE u iddum ftit biex titlesta.
Shredder_DelOne_M=Inti zgur li trid tnehhi ghal dejjem l-items%d mizjuda? Din l-azzjoni hi zgur UNRECOVERABLE u iddum ftit biex titlesta.
Shredder_NotDel_M="%s" ma gietx xredjata ghax ma tistax tikteb lil. Iccekkja ghadiex tintuza.
Shredder_InUse_M=Certu files ma gewx xredjati ghax ma'setghux. Iccekkja jekk ghadomx jintuzaw.
Shredder_Sucess_M=Ixxredjati b'success.
Shredder_OneSucess_M=Ixxredjati b'success.
Shredder_DirIsEmpty_M=Zvojtat. Ma'tistax tixreddja.
FileShredder_MaxCount_M=5000 files gew mizjuda. Jekk joghgbok zid il-bqija tal-files wara li tixreddja dawn il-5000 files.
BatchUninstall_NoneSelect_M=Jekk joghgbok ghazel program.
OtherInfo_M="%s" Jista u biss jigi uninstallat mill control panel. trid tmur il-Control Panel biex tkompli t-aninstallah?
RelationInfo_M="%s" se jigu aninstallati flimkien. Inti zgur trid tkompli bl-aninstallar?
EndProInfo_M=Il-Process "%s" ta' "%s" ghadu ghaddej. kun zgur li int lest "%s" u klikkja Kompli.
DRclickmis_M="%s" Ma' jistax jigi aninstallat bhas-soltu. Please <a>klikkja hawn</a> ghall struzzjonijiet importanti w erga aninstalla.
UinstallAgain_M=Erga Aninstalla
license_expired_M=il-Licenzja%s skadiet. klikkja <a>hawn</a> biex tixtri licenzja gdida.
license_maximum_M=Il-Licenzja %s giet attivata ghal PCs kollha u ma' tistax terga' tintuza. Ikklikkja<a>hawn</a> biex tixtri licenzja ohra u t'attiva l-IObit Uninstaller PRO ghal dan il- PC.
license_Free_M=Il-licenja %s ma tistax tigi attivata. Jekk joghgbok erga ixtri licenzja ohra ghall IObit Uninstaller PRO.
license_valid_M=Licenzja Invalida! Erga dahhal il-code mill gdid.
Uninstall_Btn_Str=Aninstalla
SureToDelete_Str=Inti zgur trid li tiddilitja dawn l-items?
DeselectAll_Str=Deselect All
SelectAll_Str=Select All
SuccessReslutFromHistroySome=Il-Files li fadal ta' <a>%d</a> programmi li gew aninstallati. Iccekkja d-dettalji hawn isfel.
SuccessWithNoResidualSingle=Inti aninstallajt b'success <a>%d</a> program minghajr l-ebda fdalijiet.
SuccessWithNoResidualSome=Inti aninstallajt b'success <a>%d</a> programmi minghajr l-ebda fdalijiet.
FailedReslut="%s" falla li jigi aninstallat. Dahhal l-email taht u klikkja il-Feedback button. l-uninstall log ser jintbghat lilna.
AllFailedReslutSingle=L-aninstallar %s falla. Dahhal l-email taht u klikkja il-Feedback button. l-uninstall log se jintbghat lilna.
AllFailedReslutSome=L-aninstallar %d tal-programmi falla. Dahhal l-email taht u klikkja il-Feedback button. l-uninstall log se jintbghat lilna.
MsgBox_SelectWin8App=Jekk joghgbok ghazel app wiehed.
NoticeInfo_One=Ghandek plug-in hazin fil browser, Iftah l-IObit Uninstaller biex tnehhieh.
NoticeInfo_Some=Plug-ins mill hziena gew identifikati fil- browser, Iftah l-IObit Uninstaller biex tnehhihom.
FuncPluginRemoveSuccessMsgBox=L-Items gew imnehhija b'success
FuncPluginSelectMsgBox=Jekk joghgbok ghazel l-ewwel item.
FuncPluginRemoveFailedMsgBox_2=Jekk joghgbok ohrog barra mil browsers biex inehhilek l-items:
FuncPluginRemoveFailedMsgBox_3=Jekk joghgbok ohrog barra mil browsers u erga pprova.
FuncPluginRemoveFailedSingleMsgBox=it-tnehhija %s falliet. Ikklikkja Feedback biex ikollok aktar ghajnuna.
FuncPluginRemoveFailedSomeMsgBox=It-tnehhija %d tal-plugins falliet. Ikklikkja Feedback biex ikollok aktar ghajnuna.
RestoreDefaultSettingsButton=Irrestorja %s Default Settings
FeedBack_Sending=Sending...
FeedBack_SendingSuccess=Is-Send success.
FeedBack_SendFailed=Is-Send falla. Ikklikkja Ok  biex ikollok Feedback on line.
licenseEg_M=E.g.: AAAAA-BBBBB-CCCCC-DDDDD
lbl_White.caption=Abjad
NouselessFiles_M=M'ghandekx files bla bzonn fil-komputer.
ExistDownloadFile_M=Inti zgur li trid tnaddaf il-files maghzula fid-Download Folder?
scaning_M=Qed Jiskenja
Exit_M=Exit
OpenIU_M=Open IObit Uninstaller
Allthefollowing_M=Il-fdalijiet maghzula gew imnadfa b'success.
SpecTClose=Aghlaq
SpecTOK=OK
SpecTHide=Hide
SpecTUninstalling=Qed janinstalla dawn il-programmi:
SpecTUninstallingM=Qed janinstalla dawn il programmi:
SpecTUninstalled=Il-program gie aninstallat.
SpecTUninstalledM=Il-programmi gew aninstallati.
Shredder_NotAddFolder_M=Ma'jistax jizdied file"%s" biex jigu xredjati ghax jista jinholoq instabbilta' fis-sistema
ForceUninstallEndProgressMsg=%s qed jahdem. jekk joghgbok waqqaf il-process u erga prova.
Setting_UITitle=User Interface
Setting_UpdateTitle=Update Method
Setting_GeneralTilte=Generali
Setting_NotificationTilte=Notification
Setting_Size_Normal=Normali
Setting_Size_Large=Kbir
Setting_Size_Larger=Akbar
Update_NoItem_Tip=Ma nstabux abdejts tal-windows.
MsgBox_SelectProgram=Jekk joghgbok ghazel program wiehed.
UpdateColumnStr_Title=Isem l-abdejt(Total:%d)
Update_Loading_Tip=Qed jillowdja l-abdejt tal-windows...
Win8NoItemTip=Ma nstabux abdejts.
Win8ColumnStr_Title=Isem tal-App(Total: %d)
Detail_Tip=Dettalji
Detail_Name=Isem
Detail_Ver=Verzjoni
Detail_Path=Installation path
Detail_Des=Description
Detail_Publisher=Publisher
Win8LoadingApp=Qed jillowdja l-Apps...
Win8ListViewGroupsWin8AppHeader=Windows Apps
Win8ListViewGroupsWin8AppSubtitle=Abdejts tal-Microsoft Corporation.
Win8ListViewGroupsThirdHeader=Third-party Apps
Win8ListViewGroupsThirdSubtitle=Abdejts tad-third-party corporations.
ListViewPlugSysbit=bit
ListViewGroupMaliciousTitle=Toolbars u Plug-ins hziena
ListViewGroupMaliciousDesc=dwk it-Toolbars u l-Plug-ins jistaw jisirqulek affarijiet privati mill-browser.
ListViewGroupAdTitle=Ad-based Toolbars and Plug-ins
ListViewGroupAdDesc=Dawk it-Toolbars u l-Plug-ins jisthu juru reklami u Banners, etc.
ListViewGroupTrustTitle=Trusted Toolbars and Plug-ins
ListViewGroupTrustDesc=Dawk it-Toolbars u l-Plug-ins ma jaghmlux hasara lil komputer. Tista zzommom jew tnehhihom kif trid.
ListViewGroupExtensions=Extensions
ListViewGroupPlugins=Plugins
ListViewGroupToolbar=Toolbar
ListViewGroupBHO=BHO
ListViewGroupActiveX=ActiveX
ListViewGroupInjectedPrograms=Injected Programs
ListViewGroupExtension_DES=L-Extensions huma qeghdin biex issebbah il-browser
ListViewGroupPlugin_DES=Il-Plugins jistghu jigu installati w uzati ghall web browser
ListViewGroupToolbar_DES=It-Toolbar jghin billi t-acccessa sites malajr jew funzjonijiet ohra
ListViewGroupBHO_DES=Il-BHO jghin billi johloq browsers personalizzati u jipprovdi interactive functions
ListViewGroupActivex_DES=L-ActiveX jintuza mill-Internet Explorer ghall 'rich media playback'
ListViewGroupInjection_DES=L-Injected programs jingektjaw third-party dll files lil browser process biex jipprovdu certu features.
PluginNoItemTip=Ma nstabux toolbars jew plug-ins in fil browser tieghek
NoSerchItem_Tip=ma nstabux items fit-tfitxija.
PluginColumnStr_Title=Ismijiet(Totali: %d)
ChromeSysncStr=Iddisattiva l-Chrome Sync feature biex inehhilek il-plug-ins kompletament. Inkella jistghu jerghu jigu installati mil gdid.
FuncPluginSysPluginMsgBox=Mhux rakkomandat biex tnehhi %s ghax certi funzjonijiet tal-browser jistghu jigu affettwati.
FuncPluginLoading=Qed jillowja...
FuncPluginRmoveSuccess=Imnehhi b'success. Qed jillowdja...
FuncVotePlugSelectMsgBox=Jekk joghgbok ghazel item ghar-rating
FuncPluginRmoveConfireSingleMsgBox=Inti zgur li trid tnehhi dan l-item mghazul?
FuncPluginRmoveConfireSomeMsgBox=Inti zgur li trid tnehhi dawn l-items mghazula?
FuncCheckBrowserMsgBox_1=%s Qed jahdem.
FuncCheckBrowserMsgBox_2=Klikkja OK biex tghalqu(L-ewwel issejvja).
FuncCheckBrowserMsgBox_3=Jew iklkja Cancel biex twaqqaf kollox.
FuncCheckBrowserMsgBox_4=%s qed jahdmu.
FuncCheckBrowserMsgBox_5=Klikkja OK biex tinforza l-gheluq(Trid l-ewwel tissejvja).
FuncCheckBrowserMsgBox_6=Jew ikklikkja Cancel biex twaqqaf kollox.
FuncPluginRemoveFailedMsgBox_1=Falla li jnehhi dawn l-items:
FuncPluginRemoveFailedMsgBox_4=%s jista jfalli li jitnehha ghax huwa protegut minn %s. Jekk joghgbok ohrog %s u irristartja l-IObit Uninstaller biex terga tipprova tnehhi.
FuncRestoreSuccessMsgBox=Irrestorja ghad default settings b'success.
FuncRestoreFailedMsgBox=Falla li jirestorja l-browser default settings, jekk joghgbok ohrog %s u erga pprova.
PluginRestoreStr=Restore %s Default Settings
FuncVoteMarkSelectMsgBox=Please rate.
FuncVoteFailedMsgBox=Ir-Rating falla, iccekkja n-network connection u erga pprova.
FuncVoteActiveVote=Rate
FuncVoteWaitting=Submitting rate, stenna ftit...
VoteStr_1=<a>1</a> il-user irrejtja. Inti diga irrejtjajt.
VoteStr_2=Ghadu ma giex ir-rate. Kun l-ewwel li tirrejtja.
VoteStr_3=<a>%d</a> il-users irrejtjaw. intom diga irrejtjawtu.
VoteStr_4=<a>%d</a> il-users irrejtjaw. X'tahseb fuq dan il- plug-in?
NoticeInfoEx_One=<a>1</a> plug-in hazin iddidekjat fil-browser, jekk joghgbok iftah l-IObit Uninstaller biex tnehhih.
NoticeInfoEx_Some=<a>%d</a> plug-ins hziena huma didekjati fil browser, jekk joghgbok iftah l-IObit Uninstaller bie tnehhihom.
UninstallPromote=Ixtri Issa
OneItemStr=%d item
SomeItemStr=%d items
OneItem=item
SomeItems=items
RebootToDelete_Str=(Iddilitja mar-reboot)
UninstallingSingleStr=Inti zgur trid t-aninstalja dan il-program?
UninstallingSomeStr=Inti zgur trid t-aninstalja dawn il-programi %d?
Uninstall_Str=Uninstalling %s (%d/%d)
Scan_Str=Scanning %s (%d/%d)
CreateRetore_Str=Qed johloq restore point, stenna ftit...
SureToDeleteSomeStr=Aninstallati <a>%d</a> programmi. jekk joghgbok iccekkja dawk il-programmi li trid tiddilitja.
SureToDeleteOneStr=Aninstallat <a>1</a> program. Jekk joghgbok iccekkja dak il-programm li trid tiddilitja.
SureToDeleteByHistroyStr=Lis-Scan komplut. Iccekkja dak l-item li trid tiddilitja.
DeletingStr=Baqa xi fdal, stenna ftit.
DeleteCancleStr=Inti zgur li trid tikkancella dan id-delete?
RestoringCancleStr=Ohloq Restore Point. Inti zgur trid twaqqaf?
RegistryCaption_Str=Registry
FileCaption_Str=File
TaskCaption_Str=Scheduled Tasks
ServiceCaption_Str=System Services
HintProToolStr=L-Uninstall Avvanzat jghinek t'aninstalla%s kollox mil qiegh.
SuccessReslutFromHistroySingle=Il-Files li fadal huma imnadfa b'success. Iccekkja d-dettalja hawn taht:
SuccessReslutFromUninstallSingle=Inti aninstallajt b'success <a>%d</a> Program bid-dettalji hawn taht:
SuccessReslutFromUninstallSome=Inti aninstallajt b'success <a>%d</a> Programmi bid-dettalji hawn taht:
SuccessReslutNeedRestartSingle=<a>%d</a> il-program huwa aninstallat.
SuccessReslutNeedRestartSome=<a>%d</a> il-programi gew aninstallati.
FileDeleteReslut=Files iddilitjati: <a>%s</a>
RegDeleteReslut=Dhul fid-direttorju iddilitjati:  <a>%d</a>
TaskDeleteReslut=Ix-Scheduled tasks iddilitjati:  <a>%d</a>
ServiceDeleteReslut=Is-Services iddilitjati:  <a>%d</a>
HtmlRecomReslutCaption=aninstallati <a>%d</a> programmi u fdalijiet imnehhija taht:
HtmlFileReCaption=<a>%s</a> files bla bzonn
HtmlRegReCaption=<a>%d</a> registry entries bla bzonn
HtmlTaskReCaption=<a>%d</a> schedule tasks invaldi
HtmlServicesReCaption=<a>%d</a>  system services invalidi
RebootYes=Irrebutja Now
RebootLater=Aktar tard
FromHistroyNoItem=Ma nstabux fdalijiet.
FromUninstallNoItem=L-aninstallar komplut.
RelatedMetroText=Dawn l-apps jigu min xulxin. Jekk t'aninstall wiehed minnhom jigi aninstallat l-iehor. Inti zgur trid tibda t'aninstalla?
RelatedSoftText=Il-Bundle ta' hawn fuq gew installati flimkien. Inti trid t'aninstalhom flimkien?
EmailHint=Jekk joghgbok dahhal l-email tajjeb hawnhekk
MemoHint=Jekk joghgbok iddeskrivi is-suggerimenti jew problemi li ltqajt maghhom.
EmailMessage=Kun zgur li l-e-mail huwa korrett sabiex inkunu nistghu nikkuntatjawk lura.
ScreenMaxMessage=L-operazjoni falliet. Ilhaqt il-massimu ta'5 screenshots.
CloseHintMsg=Inti zgur li ma tridx taghti Feedback lura?
FeedBack_1=Jiena inhobbu
FeedBack_2=Suggeriment
FeedBack_3=Falla li janinstalla
FeedBack_4=Falla li jurini il-programmi kollha
FeedBack_5=Problemi fil-Powerful scan
FeedBack_6=Irraporta xi bug
FeedBack_7=Ohrajn
RelatedProTip=Attiva il-PRO biex t'aninstalla bundle shieh.
SpecProTip1=Aninstalla %s u aktar programmi kompletament.
SpecProTip2=Attiva l-PRO biex ikollok dawn il-features u aktar.
UninstallProTipEnterCode=Dahhal il-Code
UninstallProTipActive=Attiva Issa
UninstallProTipManage=Dahhal il-licenzja
Scan_M=Skenja
Clean_M=Naddaf
Cleaning_M=Qed inaddaf
SelectAll_M=Aghzel kollox
DeselectAll_M=T'ghazilx kollox
PleaseSelect_M=Jekk joghgbok ghazel program wiehed x'tiskenja.
CloseHint_M=Aghlaq
Invalid_item_M=(Item invalidu)
ListviewHeader_Software_M=Isem il-program(Totali: %d)
SoftwareFrame_ProgramName_M=Isem il-program(Totali :%s)
History_Scan_M=Skenja
History_Detail_M=Dettalji
History_Residualfilesleft_M=Baqa xi fdalijet
Uninstalled_completely_M=Aninstallat kompletament
History_Installed_M=Installat
History_info_DouBle_M=programmi maghzula biex jigu uninstallati ghax l-ahhar darba ma gewx uninstallati tajjeb. Ikklikja 'uninstall' biex tkompli.
History_info_One_M=programm maghzul biex jigi uninstallat ghax l-ahhar darba ma giex uninstallat tajjeb. Ikklikja 'uninstall' biex tkompli
SoftwareFrame_InstallDate_M=Id-data ta'l-aninstallar
SoftwareFrame_FrequencyUse_M=L-ahhar li intuza
HistoryInfo_DisplayName=Isem tad-display
HistoryInfo_Publisher=Publisher
HistoryInfo_Version=Verzjoni
HistoryInfo_InstallDate=Id-data ta'l-aninstallar
HistoryInfo_UseSize=Spazzju uzat
HistoryInfo_Location=Il-Location
HistoryInfo_UninstallDate=Id-data ta'l-aninstallar
SoftwareFrame_Frequency_DaysHint_M=Mhux uzat ghal %s il-gurnata.
Noprograms_Frequencyofuse_M=Il-programmi kollha jintuzaw spiss.
Noprograms_100Size_M=M'ghandek l-ebda program ta'100MB misjub.
Noprograms_match_M=M'ghandekx item li fittixt.
Noprograms_Recent_M=M'ghandekx programmi li gew installati f'dawn l-10 tijiem.
Details_M=Dettalji
Export_M=Export
monthsago_M=%d Xhur ilu
yearsago_M=%d sena ilu
yearsagos_M=%d snin ilu
days_left_M=granet li fadal
SU_Title=Software Updater
SU_COL_Name=Software Updater
SU_COL_Version=Version
SU_COL_Ignore=Ignore
SU_COL_State=State
SU_Ignore=Ignore
SU_Ignored=Ignored
SU_NoIgnore=Don't ignore
SU_Update=Update
SU_Updating=Updating
SU_UpToDate=Up to date
SU_NewVersion=Verzjoni gdida
SU_CurrVersion=Il-Verzjoni kurrenti
SU_ActivePro=Attiva l-automatic updates
SU_Button_UpdateAll=Abdejtja kollox
SU_Tip=J'ghin biex ikollok l-aqwa programmi up to date u mill l-aqwa.
APTitle=Attiva il-Pros kollha
AP1=Iddilitja l-Apps l-aktar iebsa
AP2=Completely Nehhi l- Bundleware
AP3=Browser Nehhi l-Adware
AP4=Aninstalla l-plug-ins il-hziena
Explorer_Button=File Shredder
Controlpanel_Button=Powerful Uninstall

[promot_M]
CountDown_M=Offerta zmien limitat: %dd:%dh:%dm:%ds:%dms*
Youhave_M=Inti ghandek %D% OFF Special Offer minn ghand l- IObit!
ThisSpecial_M=Din l-special offer hija mahsuba ghal dawk il-users leali u li jghinuna fl-Iobit Uninstaller
OnlyDays_M=Baqa %D granet biss
enjoy_the_PRO_M=Attiva issa biex ikollok il-PRO Edition:
PromotOne_M=Jiddilitjalek Apps naqra iebsa
PromotTwo_M=Inehhilek il-Bundleware kollu
PromotThere_M=Tnehhija tal Adware mill-browser
ActivateNow_M=Attiva Issa
GiveOffer_M=Incedi din l-offerta grazzi.

[ActionCenter_M]
M_kvpCaption=Video Downloader
M_kvpInfo_NotIns=Iddawnlowdja l- videos mill YouTube u 10,000+ sites malajr.
M_kvpInfo_UpToDate=Iddawnlowdja l=videos mill YouTube and 10,000+ sites malajr.
M_kvpOffer= Download videos from YouTube and 10,000+ sites quickly.<br>Iddawlowdja videos ta’ kull format bi klikkjatura wahda.<br>Iddawlowdja il- YouTube Playlists && Lynda Playlists f’salt.<br>3X dawnlowd speed mghaggel  b’teknologija multi-tread.<br>Jaqleb online && videos lokali ta’ kull format.
M_ASCOffer=Inaddaflek u jtejjiblek il-PC b-1-click.<br>ihaffiflek il-boot time bi 300% imghaggel.<br>Inaddaflek tracci ta surfing ghal sigurta'tajba.<br>Jimmonitorja l-PC ghal aktar heffa.<br>Jipprotegilek il-PC kontra spyware komuni.
M_IMFOffer=Anti-malware program b'sahhtu hafna.<br>Jiddefendik mil-GoldenEye u l-Wannacry.<br>Online browsing u downloads sikur hafna<br>Jipprotegilek il-PC fil pront u fil fond.
M_DBOffer=Driver Database kbira (1,000,000+).<br>Jabdejtja id-Drivers bi-1-Click.<br>Abdejt safe bi drivers WHQL drivers.<br>Problemi komuni(e.g. network, sound) Fixer.<br>Inaqqas hafna l-iffrizar tal-PC.
M_SDOffer=File Access Speed gholi hafna.<br>Performance tal-hard disk mill-aqwa.<br>Jaccellera lis-Startup up sa 100% atar mghaggel.<br>Itejjiblek il-loghob ghal esperjenza sabieha.
M_SMOffer=Iregga lura l-Start Menu tal Windows 8/10.<br>Is- Search Engine b'sahhitha u semplici.
M_DLOffer=Il-mod sikur u semplici biex timaniggja l-passwords.<br>Jiggeneralek passwords unici biex jipprotegilek l-accounts.<br>Jillogja awtomatikament il- websites tieghek.<br>Ghall Windows, Mac, iOS and Android.
M_IOTOffer=L-aqwa iPhone manager w iPhone transfer software.<br>Jittransferixxi l-iPhone data bejn iPhone/iPad/iPod/PC.<br>Faccli u Free biex timmaniggja l-iPhone photos, music, videos.<br>Inaddaflek il-junk && cache biex ikollok aktar spazzju.
M_Moffer_Title=IObit Jirrakkomandalek
M_Close=Aghlaq
M_Cancel=Ikkancella
M_Moffer_Install=Installa
M_Moffer_NoteEP=Meta tikklikja"Install", tkun qed taccetta u tinstalla %s l-<a>EULA</a> && <a>Privacy Policy</a>.
M_Moffer_Refund=<a>Note:</a> Tista titlob refund wara 30 gurnata. Aqra r-<a>Refund Policy</a>.
M_Fix=Installa issa
M_Install=Installa issa
M_IMFCaption=Malware Protection
M_AC_Tips=Iehu protezzjoni u performance boost billi tinstalla il-programmi imsemmija.
M_FixAllAC=Hudhom kollha
M_HideAC=Ahbi
M_ShowAC=Uri
M_ShowACTitle=Security && Performance
M_ShowACDesc=Klikkja "Uri" biex turi programmi ohrajn. Installhom biex ikollok sigurta'u performance tajba fil-PC.
M_AC_FreeTitle='Security && Performance'
M_AC_FreeHelp_Ins=Ghall aktar sigurta'u titjib fil-programmi kollha tieghek
M_AC_FreeHelp_Upt=M'ghandekx l-aqwa funzjonijiet u features mizjuda.
M_AC_FreeHelp_OK=Meta tuza dawn il-programmi regolarment joffurlek l-aqwa sigurta' u PC performance.
M_AC_Free_EULA=L-Accettazzjoni ta' l-ahhar 'End User License Agreement' japplika ghal l-prodotti kollha tal-IObit ukoll.
M_AC_Free_ReadEULA=Aqra l-EULA
M_ShowACTitle2=Notice!
M_AC_FreeTitle2=Action Center
M_AC_FreeDetail2=`Iehu l-aqwa sigurta' mill-aqwa u boost bill programmi relatati. L-Accettazzjoni ta' l-ahhar 'End User License Agreement' japplika ghal l-prodotti kollha tal-IObit ukoll.
M_Scan=Qed jigi 'sskenjat...
M_Recomm_Ins=Recommended: Installa %s
M_Recomm_Upt=Recommended: Abdejtja %s
M_none=Xejn
M_Fix=Hu issa
M_fixing=Qed jinstalla
M_Updating=Qed jabdejtja
M_fixed=hadtu
M_failed=Falla
M_RuningWell=L-ahhar verzjoni hija 'nstallata
M_Outdated=Skadut
M_NotInstalled=Mhux Installat
M_ASCCaption=Performance tas-Systema
M_ASCInfo_NotIns=Errors fir-registru, privacy issues u junk files gew misjuba fil-PC.
M_ASCInfo_UpToDate=L-Advance SystenCare itthaffiflek l-PC u ittejjiblek il-performance bi-klikkjatura wahda.
M_ASCInfo_NeedUpDate=L-Advane SystemCare huwa skada.
M_ASCDesc=1-Klikkja biex tipprotegi u ittejjeb il-PC
M_RunASC=Scan Issa
M_IMFCaption=Protezzjoni tal-lis-Spyware
M_IMFInfo_NotIns=Ikollok protezzjoni totali bl-IObit's anti-spyware program.
M_IMFInfo_UpToDate=L-IObit Malware Fighter jipprotegilek il-PC mill Malware l-iktar hziena
M_IMFInfo_NeedUpDate=L-unti Spyware tieghek skadielek.
M_IMFDesc=Jipprotegi l-PC kontra Malware hziena.
M_RunIMF=Scan Issa
M_DBCaption=Updateter tad-Drivers
M_DBInfo_NotIns_C=misjub/a drivers skaduti, li jistghu jisslowjaw  && u jiddistabilizzaw il-PC.
M_DBInfo_NotIns=Hemm Drivers skaduti li jtellfu mill-performance tal-PC tieghek
M_DBInfo_UpToDate=Id-Driver Booster jabdejtjalek drivers skaduti fuq il-PC.
M_DBInfo_NeedUpDate=Id-Driver Update program tieghek huwa skadut.
M_DBDesc=Abdejtja d-drivers skaduti kollha tal-PC.
M_RunDB=Scan Issa
M_SDCaption='Disk Optimization'
M_SDInfo_NotIns=Misjuba issues tad-Disk optimization. Ottimizzawwhom biex jibbustja id-disk.
M_SDInfo_UpToDate=Lis-Smart Defrag jiddiffagmentalek il-PC ghl performance mill-aqwa.
M_SDInfo_NeedUpDate=Id-Defragmenter programm skada.
M_SDDesc=Id-Difragmenta id-disk ghal performance mill-aqwa.
M_RunSD=Iddefragja issa
M_SMCaption=Start Menu
M_SMInfo_NotIns=Mur lura ghall Windows Familjari mieghekbl- "Start" Menu.
M_SMInfo_UpToDate=Start Menu 8 iregga lura il- Windows "Start" Menu.
M_SMInfo_NeedUpDate=lis-Start Menu 8 huwa outdated.
M_SMDesc=Regga lura l-Windows "Start" Menu.
M_RunSM=Ibda issa
M_AMCCaption=Protezzjoni Android
M_AMCInfo_NotIns=Iehu protezzjoni tal-privatezza ghall Android Device
M_Recomm_Ins_AMC=Recommended: Installa %s lill Android device tieghek.
M_AMCDesc=Tejjeb u issigura l-Android device.
M_RunAMC=Hu issa
M_DLCaption=Il-Password Manager
M_DLInfo_NotIns=ipprotegi u immaniggja il-passwords tieghek bid-Dashlane Password Manager.
M_DLInfo_UpToDate=Qatt ma' tinsa l-Passwords bis-safe and secure Dashlane.
M_RunDL=Immaniggja
M_AC_FreeTitleHide1=Il-Programmi rakkomandati huma mohbija!
M_RunIU=Run Now
M_IUCaption='Programs Uninstaller'
M_IUInfo_NotIns=Inehhilek programmi li ma'tridx kif ukoll tolbars u plugins
M_IUInfo_UpToDate=L-IObit Uninstaller inehhilek plugins & apps fill-fond.
M_IUInfo_NeedUpDate=L-IObit Uninstaller tieghek huwa skadut.
M_FPCaption='Video Convertor'
M_FPInfo_NotIns=Gib 'video convertor' biex taqleb il-videos ghall devices differenti.
M_FPInfo_UpToDate=Hu pjacir ara il-videos fuq liema device li trid.
M_FPInfo_NeedUpDate=Il-Format Package huwa skadut.
M_iFreeUpCaption=Optimization tal-iOs
M_RuniFreeUp=Scan Issa
M_BuyiFreeUp=Buy Issa
M_iFreeUpDesc=Naddaf l-iOs device ghall aktar spazzju.
M_iFreeUpInfo_NotIns=Jista jkun hemm hafna spazzju mohli fl-iOs Devic
M_iFreeUpInfo_UpToDate=L-iFreeUp inaddaflek l-iOs Device ghall aktr spazzju.
M_iFreeUpInfo_NeedUpDate=l-iOs huwa skadut.
M_Recomm_Ins_iFreeUp=Recommended: Installa %s biex ikollok aktar spazzju
M_RunSGB=Ibbustja Issa
M_SGBCaption=Titjib tal-loghob
M_SGBInfo_NotIns=Ibbustja il-loghba u l-hajja tal-PC fl-aqwa kundizzjoni.
M_SGBInfo_UpToDate=Is-'Superb Game Boost' ihaffiflek u jirrangalek il-performance tal-loghob bi klikjatura wahda.
M_SGBInfo_NeedUpDate=Is-'Superb Game Boost' skada.
M_VipTitle=Offerta Esclussiva VIP
M_AC_ShareTip=Ixxerja l-offerta esklussiva mal-hbieb/familja
M_AC_Pro_Title=Prodotti ohra rakkomandati ghal l-aqwa sigurta' u performance.
M_ACPro_SubTitle=Ixtri issa biex tgawdi DISCOUNT fil-prezz ghall ASC PRO users biss.
M_ACPro_SubTitle_AU=Ixtri issa biex tgawdi DISCOUNT fil-prezz ghall ASC PRO users biss.
M_ActionCenterTitle_Perfectly=Il-Programmi kollha jahdmu perfetti!
M_SubTitle_Perfectly=Uza il-programmi regolari biex ikollok l-aqwa sigurta' u protezzjoni. Hu pjacir uzahom.
M_ShowACDescPro=Klikkja "Uri" biex ikollok il-prezz imnaqqas ghal Prodotti l-ohra tal-IObit.
M_AC_ProShareMail=Ixxerja via E-mails
M_AC_ProShareFB=Ixxerja via Facebook
M_AC_NoMailCLient=L-operazzjoni falliet ghax l-E-mail mhix imdahhla sewwa.
M_BuyIMF=Buy Issa
M_BuyDB=Buy Issa
M_BuySD=Buy Issa
M_ShowACTitlePro=VIP Exclusive Offer
M_AC_FreeDetail2_db=

[SendBugReportNew_FrmMain]
lblTitle.Caption=IObit Uninstaller
btnSendReport.Caption=Ibghat il-Bugreport
lblErrorDetails.Caption=Dettalji tal-Error:
lblUserEmail.Caption=l-email address tieghek:
lblSuccTips.Caption=Grazzi talli baghatilna il-bug report. Nippruvaw insolvuha mill aktar fis possibli
btnClose.Hint=Aghlaq

[SendBugReportNew_M]
M_AskUserTips=iltaqa ma'problema. Ibaghtilna l-bug report biex nirrangawh.
M_BugStatisticsTips=iltaqa ma'problema u hemm bzonn jinghalaq. Qedin naraw il-kagun issa. Stenna fit...
M_SendingTips=Qed jibghat...
M_AttentionTips=iltaqa ma'problema u hemm bzonn jinghalaq. Erga ipprova aktar tard.
M_InvalidEmailTips=L-email address mhux tajjeb! Jekk joghgbok dahhal address tajjeb Sabiex tkun tista tircievi risposta.
M_OKTips=OK

[ACD_M]
M_Downloading=Qed jiddawnlowdja:
M_TipFixing=Qed jitranga
M_Tips=Id-downlowding fil-process. Double click l-ikona biex tara l-process.
M_Installing=Qed jinstalla:
M_MD5Faild=Il-file dawnlowdjat huwa hazin. Erga ipprova aktar tard.
M_NetError=Id-dawnlowd falla minhabba network error. Erga ipprova aktar tard!
M_DiskIsFull=M'Ghandekx iktar disk space!
M_Speed=Speed:
M_AreSure_IObit=Inti zgur li trid tohrog mill-IObit Downloader?

[ACD_frmActionCenter]
lbl_Cancel.Caption=Ikkancella
lbl_Min.Caption=Cekken
btnClose.Hint=Aghlaq

